{"class_name": "Model", "keras_version": "2.0.4", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["clf0", 0, 0], ["clf1", 0, 0], ["clf2", 0, 0], ["clf3", 0, 0], ["clf4", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 28, 140, 1], "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv0", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "padding": "same", "name": "conv0", "activation": "relu", "strides": [1, 1], "filters": 32, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv0", 0, 0, {}]]], "name": "pooling0", "config": {"name": "pooling0", "strides": [2, 2], "padding": "same", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pooling0", 0, 0, {}]]], "name": "conv1", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "padding": "same", "name": "conv1", "activation": "relu", "strides": [1, 1], "filters": 64, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "pooling1", "config": {"name": "pooling1", "strides": [2, 2], "padding": "same", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pooling1", 0, 0, {}]]], "name": "conv2", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "padding": "same", "name": "conv2", "activation": "relu", "strides": [1, 1], "filters": 128, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2", 0, 0, {}]]], "name": "pooling2", "config": {"name": "pooling2", "strides": [2, 2], "padding": "same", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pooling2", 0, 0, {}]]], "name": "conv3", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "padding": "same", "name": "conv3", "activation": "relu", "strides": [1, 1], "filters": 256, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv3", 0, 0, {}]]], "name": "pooling3", "config": {"name": "pooling3", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pooling3", 0, 0, {}]]], "name": "conv4", "config": {"use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "padding": "same", "name": "conv4", "activation": "relu", "strides": [1, 1], "filters": 512, "trainable": true, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv4", 0, 0, {}]]], "name": "pooling4", "config": {"name": "pooling4", "strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "inbound_nodes": [[["pooling4", 0, 0, {}]]], "name": "flatten", "config": {"name": "flatten", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "fc1", "config": {"units": 1024, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "name": "fc1", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "dropout", "config": {"name": "dropout", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "clf0", "config": {"units": 11, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "clf0", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "clf1", "config": {"units": 11, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "clf1", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "clf2", "config": {"units": 11, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "clf2", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "clf3", "config": {"units": 11, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "clf3", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dense", "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "clf4", "config": {"units": 11, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "softmax", "name": "clf4", "trainable": true, "kernel_regularizer": null}}]}, "backend": "tensorflow"}