{"class_name": "Model", "config": {"output_layers": [["clf0", 0, 0], ["clf1", 0, 0], ["clf2", 0, 0], ["clf3", 0, 0], ["clf4", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 28, 140, 1], "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "filters": 32, "activation": "relu", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1"}, "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling1", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "name": "pooling1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "filters": 32, "activation": "relu", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2"}, "name": "conv2", "inbound_nodes": [[["pooling1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}, "name": "pooling", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout", "rate": 0.5}, "name": "dropout", "inbound_nodes": [[["pooling", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}, "name": "flatten", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 1024, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "fc1"}, "name": "fc1", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 1024, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "fc2"}, "name": "fc2", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "clf0"}, "name": "clf0", "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "clf1"}, "name": "clf1", "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "clf2"}, "name": "clf2", "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "clf3"}, "name": "clf3", "inbound_nodes": [[["fc2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "units": 11, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "clf4"}, "name": "clf4", "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "backend": "tensorflow", "keras_version": "2.0.4"}